package z10_4;

/*Частотный словарь*/

import java.util.HashMap;
import java.util.Map;

public class Main {

    public static void main(String[] args) {

        Map<String, Integer> test = new HashMap<>();

        String s = "Идейные     соображения  высшего порядка, а также новая модель организационной деятельности " +
                "способствует подготовки и реализации соответствующий условий активизации. Значимость " +
                "этих проблем настолько очевидна, что новая модель организационной деятельности представляет " +
                "собой интересный эксперимент проверки модели развития. Задача организации, в особенности же" +
                " консультация с широким активом играет важную роль в формировании направлений прогрессивного развития. " +
                "Равным образом рамки и место обучения кадров представляет собой интересный эксперимент проверки " +
                "соответствующий условий активизации.       ";

        test = FrequencyDictionary.doIt(s);

        for (Map.Entry<String, Integer> pair : test.entrySet()) {
            System.out.println(pair);
        }
    }
}